-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Янв 10 2023 г., 16:30
-- Версия сервера: 8.0.31
-- Версия PHP: 8.0.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `yiiblog`
--

-- --------------------------------------------------------

--
-- Структура таблицы `article`
--

DROP TABLE IF EXISTS `article`;
CREATE TABLE IF NOT EXISTS `article` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(255) DEFAULT NULL,
  `description` text,
  `date` date DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `tag` varchar(255) DEFAULT NULL,
  `viewed` int DEFAULT NULL,
  `topic_id` int DEFAULT NULL,
  `user_id` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `idx-topic_id` (`topic_id`),
  KEY `idx-post-user_id` (`user_id`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `article`
--

INSERT INTO `article` (`id`, `title`, `description`, `date`, `image`, `tag`, `viewed`, `topic_id`, `user_id`) VALUES
(1, '\"Аватар: Шлях води\"', 'Сюжет фільму «Аватар 2» розгортається на тому ж супутнику Пандора, що й у першій частині. Колишній морський піхотинець Джейк Саллі остаточно злився з тілом аватара народу наві і тепер вважається героєм Пандори. Людство вдалося прогнати з супутника, але його повернення з колонізаторськими амбіціями — лише питання часу.<br><br>\r\n\r\nПроте Джейку разом із дружиною Нейтирі вдалося кілька років пожити спокійно та завести дітей. Тож у новому протистоянні між наві та людьми Саллі належить відповідати за всіх своїх рідних підходити до всіх питань обережніше, щоб нікого не підставити.<br><br>\r\n\r\nПершу частину «Аватара» дуже важко назвати фільмом із гарною історією. Так, у ній є продуманий та цікавий світ, але він практично ніяк не підкріплюється привабливими персонажами. Після перегляду в пам\'яті залишаються лише краси Пандори, але не герої, які рухали сюжет. Тому з другою частиною «Аватара» Кемерону потрібно було виправити цей недолік.<br><br>\r\n\r\nІ у режисера вийшло. Не без питань, звісно, але сценарій «Аватара: Шлях води» вже можна без скромності та соромів назвати добрим. У ньому є адекватний розвиток героїв та лиходіїв, цікаві конфлікти та несподівані відкриття. Стежити за сюжетом приємно, персонажі відрізняються один від одного на рівні характеру та особливостей поведінки, тому не вивітрюються зі свідомості відразу після закінчення титрів.<br><br>\r\n\r\nОсновна частина історії концентрується на дітях Джейка та Нейтирі. Хід логічний з огляду на те, що за 13 років з моменту виходу першого «Аватара» багато глядачів напевно тепер мають своїх дітей. З одного боку, нові акценти в сюжеті дозволяють з цікавого кута розглянути споконвічний конфлікт батьків та дітей, перенісши його у фантастичну умову боротьби з людьми-колонізаторами. Але з іншого, іноді \"Аватар 2\" надто наївно підходить до зображення підлітків.<br><br>\r\n\r\nЗа фільм від них кілька разів прозвучать фрази «мені так самотньо» і «ніхто мене не розуміє», що після величезної кількості посередніх young adult фільмів уже здається поганим смаком. Саме на young adult «Аватар 2» ніби орієнтується у свої найгірші моменти сценарію. Їх не так багато, але на тлі решти всіх продуманих сцен подібні просідання історії виглядають особливо помітно.<br><br>\r\n\r\nВтім, частково у таких нюансах можна звинувачувати спрямованість фільму на максимально широку аудиторію. Включно з натовпами, які в кінотеатри ходять від сили раз на рік. Тому «Аватар 2» виглядає максимально безпечним щодо експериментів з подачею. Він розвивається за всіма законами та традиціями кіно, це практично академічний витвір мистецтва, який можна вивчати як еталонний приклад грамотно знятого фільму.<br><br>\r\n\r\nОкремо приємно, що навіть при тривалості о третій годині «Аватар: Шлях води» не відчувається затягнутим. Кожен момент, кожен діалог у ньому здаються доречними, нудьгувати не доводиться. А для тригодинних фільмів це рідкісний випадок, тож Кемерон зміг і тут.<br><br>\r\n\r\nЛише ось режисер трохи схитрував, бо «Аватар 2» далеко не завжди здатний запропонувати креативні сцени, аби захопити увагу глядачів. І тут на передній план виходити головна перевага фільму. \"Аватар: Шлях води\" - це найкрасивіший фільм з погляду технологій на сьогодні.<br><br>\r\n\r\nPR-кампанія навколо кіно якраз навколо цього й будувалася, але всі сумніви пропадають із перших секунд перегляду. Кемерон спеціально вставив на початку кілька масштабних пейзажів, щоб ви сповна оцінили, над чим знімальна команда працювала всі ці роки. «Аватар 2» виглядає надзвичайно. І навіть останній скептик, який цінує в художніх творах арт-складову, а не «графон», не зможе з цим не погодитися.<br><br>\r\n\r\nКоли кіноіндустрія прийняла технологію 3D-зображення в кіно як норму, багато режисерів і виробничих компаній ніби так і не зрозуміли, навіщо вона їм потрібна. І вставляли 3D у свої роботи лише для відповідності тренду. Однак Кемерон чудово усвідомлює, як використовувати 3D правильно. На цю технологію тут працює і структура кадру, і прольоти камери та інші технологічні нюанси. Тому при перегляді глядач буквально занурюється у те, що відбувається, а відірватися практично неможливість.<br><br>\r\n\r\nНа занурення в історію працює і підводний антураж більшої частини фільму. Підводні глибини «Аватара 2» — це суцільне заглядання та найкрасивіше зображення океанічної краси в поп-культурі. Кожен підводний кадр відчувається практично справжньою магією. Тому навіть на тривалі запливи героїв, які начебто історію нікуди особливо не рухають, дивитись цікаво.<br><br>\r\n\r\nУ цьому в принципі один із головних секретів і водночас див «Аватара: Шлях води». Якщо вдуматися, багато сцен у ньому відчутно розтягнуті. Це стосується і мирних діалогів, і боїв, і переміщень героїв. У будь-якому іншому фільмі щось схоже здавалося б надто штучним та зайвим. Але в «Аватарі 2» завдяки чудовому використанню технологій виходить відчувати насолоду навіть від найбанальніших сцен. Повірте, ніхто інший не реалізував сцену «лікар світить пацієнтові ліхтариком у вічі» на такому ж рівні, як Кемерон.<br><br>\r\n\r\n\"Аватар: Шлях води\" хочеться розбирати на окремі деталі, тому що їх у фільм достатньо. Фізика води, тертя матеріалів один про одного, відблиски та робота з кольором - все це викликає щире захоплення. Дивитися на «Аватара 2» не набридає всі три години, а Кемерон до того ж регулярно змінює умови того, що відбувається, щоб зберегти почуття новизни. А вже робота з освітленням у фільмі взагалі заслуговує на всі овації у світі.<br><br>\r\n\r\nОкремо режисер показав, як правильно знімати фільми з використанням підвищеної частоти кадрів. Багато моментів «Аватара: Шлях води» показано при 48 кадрах на секунду замість стандартних 24-х. Кіноіндустрія і раніше намагалася загравати з подібним рішенням, наприклад, у «Геміні» з Віллом Смітом. Але спроби були здебільшого провальними.<br><br>\r\n\r\n\"Аватар: Шлях води\" цілком може зробити технологію зйомки при підвищеній частоті кадрів стандартом, як це свого часу вийшло у першого \"Аватара\" з 3D-зображенням. Підвищений fps додає сценам досліджень та битв додаткового напруження пристрастей.<br><br>\r\n\r\nЗроблено все настільки добре, що навіть у самому «Аватарі 2» сцена з нормальною частотою кадрів ближче до фіналу починають здаватися дещо загальмованими. Будьте готові, що після «Аватару: Шлях води» дивитись на буквально всі інші фільми, серіали і навіть відеоігри може бути дещо боляче.<br><br>\r\n\r\nЗ таким проривним візуалом Кемерон міг зробити хоч тригодинне технодемо, де красиві сцени змінювалися б раз на півгодини без особливого сенсу. І це вже було б проривним. Тим дивніше, що з «Аватару: Шлях води» вийшло гарне, грамотне кіно. Перша частина на його тлі здається застарілою та непродуманою. Навіть у чомусь непотрібному.<br><br>\r\n\r\nАдже Кемерон планує випустити ще два фільми про світ нав\'язку, і «Шлях води» — це своєрідний пролог до майбутніх подій. Він лише вводить нас у нові умови життя головних героїв на Пандорі, змальовує майбутній масштабний конфлікт між людьми та на\'ві. При цьому все одно залишаючись закінченою та самостійною історією.<br><br>\r\n\r\nІ після побаченого в Шляху води так і хочеться, щоб Disney і 20th Century Fox дозволив Кемерону реалізувати всього задуму. Тому що, якщо пролог у режисера вийшов настільки епічним, то страшно навіть уявити, що він приготував для фіналу.', '2022-12-30', '6381b794f222319422c34ba554f19bf1.jpg', 'movies', 0, 1, 1),
(2, 'Best movie 2', 'Everything about cinema', '2022-12-30', '9219b97ca2b2976412b9bc7aa85d7b1a.jpg', 'movies', 0, 1, 1),
(4, 'Not another teen movie', 'Article abot Not another teen movie', '2023-01-10', NULL, 'movies', 0, 1, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `comment`
--

DROP TABLE IF EXISTS `comment`;
CREATE TABLE IF NOT EXISTS `comment` (
  `id` int NOT NULL AUTO_INCREMENT,
  `text` varchar(255) DEFAULT NULL,
  `user_id` int DEFAULT NULL,
  `comment_id` int DEFAULT NULL,
  `article_id` int DEFAULT NULL,
  `date` date DEFAULT NULL,
  `delete` tinyint(1) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `idx-post-user_id` (`user_id`),
  KEY `idx-article_id` (`article_id`),
  KEY `idx-comment_id` (`comment_id`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `comment`
--

INSERT INTO `comment` (`id`, `text`, `user_id`, `comment_id`, `article_id`, `date`, `delete`) VALUES
(1, 'Comment 1', 1, NULL, 1, '2022-12-30', 1),
(2, 'Ефекти супер. А ось сюжет просто ніякий, його просто нема! Крім того, мені не сподобалися 3D-ефекти, про які писали усі ЗМІ. Вони наче прямо з 2009 року.', 1, NULL, 1, '2023-01-10', NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `migration`
--

DROP TABLE IF EXISTS `migration`;
CREATE TABLE IF NOT EXISTS `migration` (
  `version` varchar(180) NOT NULL,
  `apply_time` int DEFAULT NULL,
  PRIMARY KEY (`version`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `migration`
--

INSERT INTO `migration` (`version`, `apply_time`) VALUES
('m000000_000000_base', 1672398556),
('m221230_105945_create_topic_table', 1672398766),
('m221230_110018_create_user_table', 1672398766),
('m221230_110034_create_article_table', 1672398766),
('m221230_110052_create_comment_table', 1672398766);

-- --------------------------------------------------------

--
-- Структура таблицы `topic`
--

DROP TABLE IF EXISTS `topic`;
CREATE TABLE IF NOT EXISTS `topic` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `topic`
--

INSERT INTO `topic` (`id`, `name`) VALUES
(1, 'Кращи фільми');

-- --------------------------------------------------------

--
-- Структура таблицы `user`
--

DROP TABLE IF EXISTS `user`;
CREATE TABLE IF NOT EXISTS `user` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `login` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `user`
--

INSERT INTO `user` (`id`, `name`, `login`, `password`, `image`) VALUES
(1, 'Vlad', 'vlad@gmail.com', '1234', 'd4b08366b5d9590b51b36f558632fbbe.png'),
(2, 'stas', 'stas@gmail.com', '1111', NULL),
(3, 'Vlad2', 'vlad2@gmail.com', '0000', NULL);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
